Taxi/test_billing_fin_payouts/cron/static/test_switch_accounting_periods/revenues_static_data_expected.json

[
  {
    "accounting_date": "2021-11-18",
    "accounting_period": "2022-02",
    "amount": "48.63",
    "amount_tlog": "40.5280",
    "client_id": "39420794",
    "contract_id": "330904",
    "currency": "RUB",
    "external_ref": "DEFAULT",
    "id": 1,
    "payload": {
      "account_info": {
        "account": "ЛСТ-12345678",
        "account_type": "YANDEX_SERVICE"
      },
      "agglomeration": "KRRc",
      "alias_id": "c5664b954607cdae9963c412df06851e",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "country_netting_flag": true,
      "detailed_product": "gross_commission_trips",
      "driver_details": {
        "db_id": "bb8a757b12e54dfdbf23708ab31e0151",
        "uuid": "df1ea215307c87f035f1ada1deec23da"
      },
      "event_time": "2021-11-18T06:16:20.497654+00:00",
      "invoice_date": "2021-11-18T06:16:17.000000+00:00",
      "product": "order",
      "service_id": 128,
      "tariff_class": "econom",
      "transaction_time": "2021-11-18T06:16:27.036461+00:00",
      "transaction_type": "payment",
      "vat_rate": "20.00"
    },
    "row_index": 0,
    "status_code": "WITH_NETTING",
    "table_name": "2021-11-18"
  },
  {
    "accounting_date": "2022-02-18",
    "accounting_period": "2022-02",
    "amount": "-1.20",
    "amount_tlog": "1.0000",
    "client_id": "39420794",
    "contract_id": "330904",
    "currency": "RUB",
    "external_ref": "DEFAULT",
    "id": 2,
    "payload": {
      "account_info": {
        "account": "ЛСТ-12345678",
        "account_type": "YANDEX_SERVICE"
      },
      "agglomeration": "KRRc",
      "alias_id": "a3e7502045db3068a4d3d92aa3cece0a",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "country_netting_flag": true,
      "detailed_product": "gross_taximeter_payment",
      "driver_details": {
        "db_id": "6828a91ad5814e68874b07d261c20426",
        "uuid": "1cf87da69594151048d8f6364f054650"
      },
      "event_time": "2022-02-18T06:16:20.497654+00:00",
      "invoice_date": "2021-11-18T06:16:17.000000+00:00",
      "product": "order",
      "service_id": 128,
      "tariff_class": "econom",
      "transaction_time": "2021-11-18T06:16:27.036461+00:00",
      "transaction_type": "refund",
      "vat_rate": "20.00"
    },
    "row_index": 1,
    "status_code": "WITH_NETTING",
    "table_name": "2021-11-18"
  },
  {
    "accounting_date": "2022-03-18",
    "accounting_period": "2022-03",
    "amount": "0.6700",
    "amount_tlog": "0.6700",
    "client_id": "39420794",
    "contract_id": "330904",
    "currency": "RUB",
    "external_ref": null,
    "id": 3,
    "payload": {
      "agglomeration": "KRRc",
      "alias_id": "a3e7502045db3068a4d3d92aa3cece0a",
      "amount_with_vat_flag": true,
      "detailed_product": "gross_software_subscription_fee",
      "driver_details": {
        "db_id": "6828a91ad5814e68874b07d261c20426",
        "uuid": "1cf87da69594151048d8f6364f054650"
      },
      "event_time": "2022-03-18T06:16:20.497654+00:00",
      "invoice_date": "2021-11-18T06:16:17.000000+00:00",
      "product": "coupon_plus",
      "service_id": 128,
      "tariff_class": "econom",
      "transaction_time": "2021-11-18T06:16:27.036461+00:00",
      "transaction_type": "payment"
    },
    "row_index": 2,
    "status_code": "IGNORE",
    "table_name": "2021-11-18"
  },
  {
    "accounting_date": "2021-11-18",
    "accounting_period": "2022-02",
    "amount": "18.0900",
    "amount_tlog": "18.0900",
    "client_id": "55039351",
    "contract_id": "617545",
    "currency": "RUB",
    "external_ref": null,
    "id": 4,
    "payload": {
      "agglomeration": "KJAc",
      "alias_id": "a3e7502045db3068a4d3d92aa3cece0a",
      "detailed_product": "gross_commission_trips",
      "driver_details": {
        "db_id": "6828a91ad5814e68874b07d261c20426",
        "uuid": "1cf87da69594151048d8f6364f054650"
      },
      "event_time": "2021-11-18T06:16:19.720913+00:00",
      "invoice_date": "2021-11-18T06:16:15.944000+00:00",
      "product": "order",
      "service_id": 111,
      "tariff_class": "econom",
      "transaction_time": "2021-11-18T06:16:27.036743+00:00",
      "transaction_type": "payment"
    },
    "row_index": 3,
    "status_code": "TEST",
    "table_name": "2021-11-18"
  },
  {
    "accounting_date": "2021-11-18",
    "accounting_period": "2022-02",
    "amount": "1.20",
    "amount_tlog": "1.0000",
    "client_id": "55039351",
    "contract_id": "617545",
    "currency": "RUB",
    "external_ref": "DEFAULT",
    "id": 5,
    "payload": {
      "account_info": {
        "account": "ЛСТ-12345678",
        "account_type": "YANDEX_SERVICE"
      },
      "agglomeration": "KJAc",
      "alias_id": "eb3050bfbf691ff58595eeee1134b2b5",
      "contract_info": {
        "alias": "CONTRACT_ALIAS",
        "country_geo": 225,
        "firm_id": 13,
        "link_contract_id": 123457,
        "netting_flag": 1,
        "person_id": 123
      },
      "country_netting_flag": true,
      "detailed_product": "gross_taximeter_payment",
      "driver_details": {
        "db_id": "af9fab7738254c56b32c8ef1d288c0d9",
        "uuid": "eb286b4e784dcadbe14c4b554ab58757"
      },
      "event_time": "2021-11-18T06:16:19.720913+00:00",
      "invoice_date": "2021-11-18T06:16:15.944000+00:00",
      "product": "order",
      "service_id": 111,
      "tariff_class": "econom",
      "transaction_time": "2021-11-18T06:16:27.036743+00:00",
      "transaction_type": "payment",
      "vat_rate": "20.00"
    },
    "row_index": 4,
    "status_code": "WITH_NETTING",
    "table_name": "2021-11-18"
  }
]
